Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.media_bucket has been deleted
- resource "aws_s3_bucket" "media_bucket" {
      - id                          = "prod-sharedservices-media-bucket" -> null
        tags                        = {}
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "tqlw9k" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_cluster.render_cluster will be created
+ resource "aws_ecs_cluster" "render_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "sharedservices-render-cluster"
      + tags_all = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }

      + setting (known after apply)
    }

  # aws_ecs_task_definition.render_video will be created
+ resource "aws_ecs_task_definition" "render_video" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "python",
                      + "lambda_function.py",
                    ]
                  + environment      = [
                      + {
                          + name  = "EVENT_JSON"
                          + value = ""
                        },
                      + {
                          + name  = "FFMPEG_PATH"
                          + value = "/opt/bin/ffmpeg"
                        },
                      + {
                          + name  = "TARGET_BUCKET"
                          + value = "prod-sharedservices-artifacts-bucket"
                        },
                    ]
                  + image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:3308d2f18e8e8b4cf6e788aad5560862b816f499c61501995257b347cf5b3a9e"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/render_video"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/mnt/efs"
                          + readOnly      = false
                          + sourceVolume  = "efs"
                        },
                    ]
                  + name             = "render_video"
                },
            ]
        )
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "render_video"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "efs"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0e0f22150227b252a"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0

              + authorization_config {
                  + access_point_id = "fsap-076e0e4723ceab689"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_iam_role.ecs_task_execution_role will be created
+ resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sharedservices_ecs_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task_role will be created
+ resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sharedservices_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.step_functions_ecs will be created
+ resource "aws_iam_role_policy" "step_functions_ecs" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sharedservices_step_functions_role"
    }

  # aws_iam_role_policy_attachment.ecs_exec_managed will be created
+ resource "aws_iam_role_policy_attachment" "ecs_exec_managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "sharedservices_ecs_exec_role"
    }

  # aws_iam_role_policy_attachment.ecs_task_s3 will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_s3" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::825765422855:policy/sharedservices_s3_full_policy"
      + role       = "sharedservices_ecs_task_role"
    }

  # aws_lambda_function.render_video will be updated in-place
~ resource "aws_lambda_function" "render_video" {
        id                             = "render_video"
      ~ image_uri                      = "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:e0de4ee9ce75e350827d97fdad69d2f18e2b90e4b9db4d47971ce8ecf19b56d5" -> "825765422855.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:3308d2f18e8e8b4cf6e788aad5560862b816f499c61501995257b347cf5b3a9e"
      ~ last_modified                  = "2025-05-04T14:12:08.000+0000" -> (known after apply)
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_s3_bucket.media_bucket will be created
+ resource "aws_s3_bucket" "media_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-sharedservices-media-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete_posts_after_1_week"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "posts/"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.media_bucket_encryption will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "media_bucket_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "alias/aws/s3"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.media_bucket_versioning will be created
+ resource "aws_s3_bucket_versioning" "media_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_sfn_state_machine.manual_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "manual_workflow" {
      ~ definition                = jsonencode(
            {
              - Comment = "State machine for the manual post workflow"
              - StartAt = "GetLogo"
              - States  = {
                  - DeleteLogo  = {
                      - Next       = "NotifyUser"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:delete_logo"
                      - ResultPath = "$.deleteLogoResult"
                      - Type       = "Task"
                    }
                  - GetLogo     = {
                      - Next       = "RenderVideo"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:get_logo"
                      - ResultPath = "$.logoResult"
                      - Type       = "Task"
                    }
                  - NotifyUser  = {
                      - End        = true
                      - InputPath  = "$"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:notify_post"
                      - ResultPath = "$.notificationResult"
                      - Type       = "Task"
                    }
                  - RenderVideo = {
                      - Next       = "DeleteLogo"
                      - Resource   = "arn:aws:lambda:us-east-2:825765422855:function:render_video"
                      - ResultPath = "$.videoResult"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-2:825765422855:stateMachine:manual_workflow"
        name                      = "manual_workflow"
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 11 to add, 3 to change, 0 to destroy.
╷
│ Warning: AWS resource not found during refresh
│ 
│   with aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle,
│   on s3.tf line 29, in resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle":
│   29: resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
│ 
│ Automatically removing from Terraform State instead of returning the error,
│ which may trigger resource recreation. Original error: couldn't find
│ resource
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```

**Note: Objects have changed outside of Terraform**
Plan: 11 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```